app/views/user/index.html.erb

SELECT "users".* FROM "users"
---
  </tr>
  <% User.all.each do |user| %>