app/views/photos/index.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <tr>
          <td> <%= link_to comment.user.first_name, controller: 'photos', action: :index, id: comment.user.id%> </td>