app/controllers/photos_controller.rb

  def index
    @photo_all = Photo.where(:user_id => params[:id])
    @comment_all = Comment.where(:photo_id => @photo_all)
    @comment_count = Comment.where(:photo_id => @photo_all).count
---
SELECT "photos".* FROM "photos" WHERE "photos"."user_id" = ?  [["user_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" IN (SELECT "photos"."id" FROM "photos" WHERE "photos"."user_id" = ?) AND "comments"."photo_id" = ?  [["user_id", 1], ["photo_id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."photo_id" IN (SELECT "photos"."id" FROM "photos" WHERE "photos"."user_id" = ?)  [["user_id", 1]]